Repository: 84000/data-translation-memory
Catalog: toh55_84000-the-teaching-on-the-effulgence-of-light.tmx
Source language: bo
Languages: en

source: །གསེར་འདབ་རྒྱལ་པོ་བྱེ་བ་ཕྲག །བརྒྱད་ཅུ་སྙེད་ནི་འདུས་པ་དག །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: All the eight hundred million garuḍa kings who had gathered there

source: །སྡོམ་པ་ལྔ་ནི་རབ་བསྲུངས་ཏེ།
en: Observed the five vows

source: །དྲི་ཟའི་རྒྱལ་པོ་བྱེ་བ་ཕྲག །བརྒྱད་ཅུ་སྙེད་ནི་འདུས་པ་དག །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: All the eight hundred million gandharva kings who had gathered there

source: །རོལ་མོ་བརྒྱ་སྟོང་རྣམས་བྱས་ཏེ། །སྒྲ་སྙན་དག་ནི་རབ་ཕྱུང་ནས།
en: Played a hundred thousand musical instruments, making delightful sounds

source: །བཅོམ་ལྡན་དེ་ལ་མཆོད་བྱས་པས། །ལུང་བསྟན་པ་ཡང་ཐོབ་པར་གྱུར།
en: As offerings to the Blessed One, and also received that prophecy.

source: །གནོད་སྦྱིན་རྒྱལ་པོ་ཁྲག་ཁྲིག་སྙེད། །མདོ་སྡེ་འདི་ནི་ཐོས་པས་ན།
en: All the hundred million yakṣa kings developed intense faith

source: །སངས་རྒྱས་ཡེ་ཤེས་དག་ལས་ནི། །ཤིན་ཏུ་དད་པ་སྐྱེས་པར་གྱུར།
en: In the pure wisdom of the Buddha,

source: །དེ་དག་ཐམས་ཅད་ཀུན་གྱིས་ཀྱང་། །བྱང་ཆུབ་ལུང་བསྟན་ཐོབ་པར་གྱུར།
en: And all of them also received the prophecy of their awakening.

source: །ཟླ་འོད་འདི་ལྟར་ཤེས་པར་གྱིས།
en: “Candraprabha, you should know that, at that time,

source: །དེ་ཚེ་རྒྱལ་པོ་སྒྲ་མོས་པས།
en: You were the king Devoted to Words,

source: །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །བཅོམ་ལྡན་དེ་ལ་མཆོད་བྱས་པ།
en: Who worshiped that blessed one with those various offerings;

source: །གཞན་ཡིན་སྙམ་དུ་མི་བལྟ་སྟེ། །དེ་ནི་ཁྱོད་དག་ཉིད་ཡིན་ནོ།
en: Do not think that this was someone else.

source: །ཁྱོད་ནི་སྔོན་འདས་དུས་ཀྱི་ཚེ། །མདོ་སྡེ་འདི་ནི་ཐོས་པའི་རྒྱུས།
en: “You have already heard that sūtra in the past,

source: །དེ་ལྟ་བས་ན་དེང་འདིར་ཡང་།
en: And this is the reason why today,

source: །འདི་ཉིད་སླར་ཡང་ཞུས་པ་ཡིན།
en: In this place, you once again Request to hear it.

source: །ང་ནི་མྱ་ངན་འདས་པའི་འོག །གང་ཡང་རུང་བ་སུ་ཞིག་གིས།
en: “After I pass into nirvāṇa,

source: །དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དག །རྣམ་པར་འཇིག་པའི་དུས་ཀྱི་ཚེ།
en: When the wheels of the sacred Dharma are about to cease,

source: །ཆོས་ཀྱི་བསྟན་པ་འདི་དག་ནི། །དང་བའི་སེམས་ནི་གང་བསྐྱེད་པ།
en: Whoever develops faith in these Dharma teachings

source: །འདི་ལྟ་བུ་ཡི་མདོ་སྡེ་དག །རྒྱ་ཆེར་ཡང་དག་སྟོན་པར་ནུས།
en: Will be able to teach this discourse on a vast scale.

source: །མ་འོངས་མདོ་སྡེ་འདི་ནི་གང་སྟོན་པ།
en: “Those who teach this discourse in the future

source: །དེས་ནི་ང་ཡི་ཆོས་འཛིན་སྲུང་བར་བྱེད།
en: Will be the guardians of my Dharma;

source: །དེ་ནི་འདྲོན་མང་དེད་པའི་དེད་དཔོན་འདྲ།
en: Like leaders guiding many travelers,

source: །རིན་ཆེན་གཏེར་འཛིན་སྲུང་བ་ཞེས་ཀྱང་བྱ།
en: They will be known as guardians of the precious treasure

source: །མ་འོངས་དུས་ཚེ་མདོ་འདི་གང་ཐོས་ནས།
en: “Know that those who hear this discourse in the future

source: །སྐད་ཅིག་ཙམ་དུ་མོས་པ་སྐྱེད་བྱེད་པ། །དེ་ནི་སངས་རྒྱས་བྱིན་གྱིས་བརླབས་པ་ཡིན། །འཇམ་དཔལ་བྱིན་གྱིས་བརླབས་པར་རིག་པར་བྱ།
en: And become interested for a mere moment will be blessed by the Buddha and Mañjuśrī;

source: །དེས་ནི་སངས་རྒྱས་མང་པོ་མཐོང་འགྱུར་བས། །གསང་བའི་ཆོས་གཏད་ཤེས་རབ་རྣོ་བར་འགྱུར།
en: They will behold many buddhas, who will entrust secret teachings to them, And their insight will become sharp.

source: །སེམས་ཅན་གང་དག་སེམས་དྲང་མཉེན་དེས་ཤིང་།
en: “Beings who are honest, pliant, and gentle,

source: །རྟག་ཏུ་སངས་རྒྱས་རིམ་གྲོ་བྱེད་ལ་བརྩོན།
en: Who continuously strive to serve the buddhas,

source: །བདག་མེད་སྒོམ་ཞིང་བྱམས་དང་བཟོད་སྐྱེད་པ།
en: Who meditate on selflessness, cultivate love, and develop patience

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར།
en: Will be interested in this discourse.

source: །གང་ཞིག་རྟག་ཏུ་མི་དགེའི་སེམས་འཆང་ཞིང་།
en: “Someone who constantly has a nonvirtuous attitude,

source: །རྙེད་ལ་གདུ་ཞིང་ཆོག་མི་ཤེས་པ་དང་། །རབ་དབེན་རྣམས་ལ་མོས་པར་མི་འགྱུར་བ།
en: Who insatiably hankers after personal gains, And who has no interest in being disengaged

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར།
en: Will not be interested in this discourse.

source: །གང་ཞིག་དེ་བཞིན་གཤེགས་པ་རྣམས་མཆོད་དང་། །དམ་ཆོས་ཟབ་མོ་ལེགས་པར་རྟོགས་པ་དང་། །སངས་རྒྱས་ཡང་དག་ཡེ་ཤེས་ཡིད་ཆེས་པ།
en: “Someone who worships the thus-gone ones, Who properly understands the profound and sacred Dharma, And who trusts in the genuine wisdom of the buddhas

source: །གང་ཞིག་སེམས་གཡེང་དད་པའི་སེམས་མེད་ཅིང་།
en: “Someone who is distracted and faithless,

source: །རྟག་ཏུ་སྲོག་གཅོད་གདུལ་བར་རབ་དཀའ་དང་། །འདོད་པའི་ཡུལ་རྣམས་ཀུན་གྱི་བྲན་བྱེད་པ།
en: Who repeatedly takes the lives of others, who is hard to tame, And who is enslaved by all the objects of desire

source: །གང་ཞིག་རྟག་ཏུ་དགོན་གནས་རབ་མོས་ཤིང་།
en: “Someone who is always inclined to stay in the wilderness,

source: །གཅིག་པུ་དབེན་པར་འདུག་ཅིང་སེམས་ཞི་དང་། །རྙེད་དང་གཉེན་ལ་མངོན་པར་ཞེན་མེད་པ།
en: Who resides alone with a peaceful mind, And who is without attachment to gains and friends

source: །གང་ཞིག་གྲོགས་ངན་དག་གི་རྗེས་འབྲང་ཞིང་།
en: “Someone who follows unwholesome friends,

source: །བདག་དང་གཞན་གྱི་དགེ་བ་འཇིག་བྱེད་དང་། །ཚུལ་ཁྲིམས་ཏིང་འཛིན་དག་ནི་ཆེར་ཉམས་པ།
en: Who destroys their own and others’ virtues, And who lets their discipline and absorption become greatly corrupted

source: །གང་ཞིག་ཡིད་མོས་ཤིན་ཏུ་རྣམ་དག་ཅིང་།
en: “Someone with pure aspirations

source: །རྟག་ཏུ་ཤེས་རབ་ཆོས་རྣམས་རབ་འབྱེད་དང་། །དགེ་བའི་བཤེས་གཉེན་དག་གིས་རབ་བསྲུངས་པ།
en: Who always examines phenomena with insight And is guarded by virtuous friends

source: །གང་ཞིག་གཉེན་གྱི་ཁྱིམ་ལ་རབ་ཆགས་ཤིང་།
en: “Someone who is strongly attached to the family household,

source: །མེ་ཏོག་འབྲས་བུ་བྱིན་ནས་དགའ་བྱེད་དང་། །སེམས་ལ་དྲང་པོ་མེད་ཅིང་སྒྱུ་འཆང་བ།
en: Who seeks others’ favors by giving flowers and fruits, And who is dishonest and cunning

source: །གང་ཞིག་རྟག་ཏུ་སངས་རྒྱས་དྲིན་དྲན་ཞིང་།
en: “Someone who always recollects the Buddha’s kindness,

source: །དགེ་བའི་རྩ་བ་མཆོག་ལ་མོས་པ་དང་། །བྱང་ཆུབ་བསྔོ་ཞིང་གཡོ་སྒྱུ་མེད་གྱུར་པ།
en: Who yearns for the highest roots of virtue, And who sincerely dedicates their acts to awakening

source: །གང་ཞིག་ཆུང་མ་བུ་མོ་སྲེད་ཆགས་ཤིང་།
en: “Someone who lusts for women and girls And always aspires to frolic with women

source: །གོས་མཆོག་སྣ་ཚོགས་དག་གིས་རབ་བརྒྱན་ནས། །རྟག་ཏུ་དེ་དང་ལྷན་ཅིག་རྩེ་སྨོན་པ།
en: Who are adorned in all kinds of splendid garments

source: །གང་ཞིག་སེམས་ཟབ་གནས་པ་མེད་གྱུར་ཅིང་།
en: “Someone with a deep mindset who has left all dwellings,

source: །འདོད་པའི་ཡུལ་གྱིས་གོས་པ་མེད་པ་དང་། །ཟས་སྐོམ་དག་གིས་གཡོ་སྒྱུ་མི་སྐྱེད་པ།
en: Who is not sullied by objects of desire, And who does not deceive others for the sake of food and drink

source: །གང་ཞིག་སྐྱེ་དགུ་རྣམས་ལ་འདི་སྐད་དུ།
en: “Someone who says to everyone

source: །འདོད་ཆགས་སྤྱད་ཀྱང་ཉེས་མེད་གང་ཟེར་བ།
en: That it is not a fault to indulge in desires

source: །དུས་གསུམ་སངས་རྒྱས་རྣམས་ལ་སྐུར་བ་ཡིན།
en: And who denigrates the buddhas of the three times

source: །གང་ཞིག་ཡིད་ཆེས་རྟག་ཏུ་རབ་བརྟན་ཞིང་།
en: “Someone with constant and firm trust

source: །ནན་ཏན་བསྐྱེད་ནས་ཆོས་རྣམས་ཚོལ་བ་ལ།
en: Who pursues the Dharma persistently

source: །སྐྱོ་བ་མེད་ཅིང་བརྙས་པར་མི་བྱེད་པ།
en: And never becomes weary or disrespectful while doing so

source: །གང་ཞིག་ཆུང་མ་བུ་མོ་མངོན་ཞེན་ཅིང་།
en: “Someone who craves women,

source: །རྟག་ཏུ་འདོད་པའི་ཡུལ་ནི་རྗེས་དྲན་དང་། །ཤེས་རབ་མི་སྒོམ་རྒྱ་ཆེར་ཕན་མི་འདོགས།
en: Who constantly keeps objects of his lust in mind Without cultivating insight or benefiting others extensively,

source: །གང་ཞིག་རི་དང་ནགས་ཁྲོད་རབ་གནས་ཤིང་།
en: “Someone who lives in mountains or forests And is purified by cultivating insight

source: །ཤེས་རབ་བསྒོམས་ནས་ཤིན་ཏུ་དགའ་གྱུར་དང་། །འཚོ་བའི་ཡོ་བྱད་དག་ལ་འདོད་མེད་པ།
en: Without any desire for the most basic necessities

source: །གང་ཞིག་མིག་གི་སྔོན་དང་ཕྱི་མའི་མཐའ། །རྟག་ཏུ་རྨོངས་དང་མི་རྟོགས་གང་ཡིན་པ།
en: The past and future limits of the eye

source: །དེ་ནི་གཏི་མུག་བདུད་ཀྱིས་བཅིངས་པས་ན།
en: Is bound by the demon of ignorance

source: །གང་ཞིག་མིག་གི་སྔོན་དང་ཕྱི་མའི་མཐའ། །རྟག་ཏུ་རྟོགས་ཤིང་རྨོངས་པ་མེད་གྱུར་པ།
en: The past and future limits of the eye

source: །དེ་ནི་བདུད་ཀྱིས་བཅིངས་ལས་གྲོལ་བས་ན།
en: Is liberated from demonic bondage

source: །གང་ཞིག་མིག་མཐའ་ཡོད་དང་མེད་པ་ལ། །རྟག་ཏུ་རྨོངས་ནས་ཁོང་དུ་མ་ཆུད་པ།
en: The existence and nonexistence of the eye’s limit

source: །གང་ཞིག་མིག་མཐའ་ཡོད་དང་མེད་པ་དག །རྟག་ཏུ་རྟོགས་ཤིང་རྨོངས་པ་མེད་གྱུར་པ།
en: “Someone who is always free from delusion and understands The limits of existence and nonexistence of the eye

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མི་གནས་འཇིག་པའི་མཚན་ཉིད་ལ།
en: And will therefore be interested in this discourse.

source: །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མི་ཆུད་པ།
en: “Someone who is always deluded and does not comprehend The eye’s characteristics of abiding and disintegration

source: །གང་ཞིག་མི་གནས་འཇིག་པའི་མཚན་ཉིད་དག །རྟག་ཏུ་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ།
en: “Someone who is always free from delusion and comprehends The eye’s characteristics of abiding and disintegration

source: །རྣ་བ་སྣ་དང་ལྕེ་ལུས་ཡིད་དག་དང་། །གཟུགས་སྒྲ་དྲི་རོ་རེག་བྱ་ཆོས་རྣམས་དང་། །ས་ཆུ་མེ་རླུང་ངོ་བོ་ཉིད་དག་དང་། །དངོས་པོ་སེམས་ཅན་སྡུག་བསྔལ་ཕུང་པོ་དང་། །ཁམས་དང་འཇིག་རྟེན་སྐྱེ་སྒྲ་མི་བདེན་དང་། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་ང་རྒྱལ་སྲེད།
en: Forms, sounds, scents, textures, mental phenomena, Earth, water, fire, and air. “It also applies to matter, sentient beings, suffering, The aggregates, the elements, worldly arising, untrue words, Desire, anger, ignorance, pride, craving, pretense,

source: །འཆབ་རྒྱགས་སེར་སྣ་ཕྲག་དོག་གཡོ་སྒྱུ་དང་། །ཁྲོ་སོགས་པར་ཡང་དེ་བཞིན་རིག་པར་གྱིས། །གང་ཞིག་མིག་ཟད་མཐའ་ནི་དེ་དག་ལ།
en: Vanity, miserliness, envy, deceit, aggression, and so forth.

source: །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་པར་ལྷུང་བས་ན།
en: Falls into the experience of worldly beings

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་ཟད་མཐའ་ནི་དེ་དག་ལ།
en: And will therefore not be interested in this discourse.

source: །རྟག་པར་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ།
en: “Someone who is always free from delusion and comprehends The limit of the exhaustion of the eye

source: །དེ་ནི་སྐྱེ་བོའི་སྤྱོད་དང་བྲལ་བས་ན།
en: Is free from the experience of worldly beings

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་གི་འཇིག་པ་དེ་དག་ལ།
en: And will therefore be interested in this discourse.

source: །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མ་ཆུད་པ།
en: “Someone who is always deluded and does not comprehend The disintegration of the eye

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་གི་འཇིག་པ་དེ་དག་ལ།
en: And will therefore not be interested in this discourse.

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་པར་འགྱུར། །གང་ཞིག་མིག་གི་རབ་དབེན་དེ་དག་ལ།
en: And will therefore be interested in this discourse.

source: །དེས་ནི་མདོ་སྡེ་འདི་ལ་མོས་མི་འགྱུར། །གང་ཞིག་མིག་གི་རབ་དབེན་དེ་དག་ལ།
en: And will therefore not be interested in this discourse.

source: །གང་ཞིག་མིག་གི་འགྲོ་འོང་མེད་པ་ལ། །རྟག་ཏུ་རྨོངས་ཤིང་ཁོང་དུ་མ་ཆུད་པ།
en: The absence of coming and going of the eye

source: །གང་ཞིག་མིག་གི་འགྲོ་འོང་མེད་པ་དག །རྟག་པར་ཁོང་དུ་ཆུད་ཅིང་རྨོངས་མེད་པ།
en: “Someone who is always free from delusion and comprehends The absence of coming and going of the eye

source: །གང་ཞིག་མིག་ལ་བདག་མེད་མ་རྟོགས་ནས།
en: “Someone who does not realize the selflessness of the eye

source: །མིག་ཟད་ངོ་བོ་ཉིད་ལ་རྟག་རྨོངས་པ།
en: And is always deluded about the essential nature of its exhaustion

source: །གང་ཞིག་མིག་ལ་བདག་མེད་རབ་རྟོགས་ནས།
en: “Someone who realizes the selflessness of the eye

source: །མིག་ཟད་ངོ་བོ་རྟག་ཏུ་རྟོགས་གྱུར་པ།
en: And always understands the essential nature of its exhaustion

source: །བཟོད་པའི་གནས་ལ་རྟག་ཏུ་རྨོངས་གྱུར་པ།
en: And is always deluded about the objects of the practice of patience

source: །བཟོད་པའི་གནས་ནི་རྟག་ཏུ་རྟོགས་གྱུར་པ།
en: And always understands what objects to accept

source: །གང་ཞིག་མིག་ཟད་ངོ་བོ་མ་རྟོགས་པ།
en: “Someone who does not realize The essence of the eye’s exhaustion

source: །དེ་ནི་མི་གནས་ཚུལ་ཁྲིམས་བསྒྲུབ་མི་ནུས། །མི་གནས་ཚུལ་ཁྲིམས་མངོན་པར་མི་སྒྲུབ་པས།
en: Is unable to accomplish nonabiding discipline

source: །གང་ཞིག་མིག་ཟད་ངོ་བོ་རབ་རྟོགས་པ།
en: The essence of the eye’s exhaustion

source: །དེས་ནི་མི་གནས་ཚུལ་ཁྲིམས་བསྒྲུབ་པར་ནུས། །མི་གནས་ཚུལ་ཁྲིམས་མངོན་པར་བསྒྲུབ་པས་ན།
en: Is able to accomplish nonabiding discipline

source: །དེས་ནི་ཟག་མེད་ཚུལ་ཁྲིམས་བསྒྲུབ་མི་ནུས། །ཟག་མེད་ཚུལ་ཁྲིམས་མངོན་པར་མི་བསྒྲུབ་པས།
en: Is unable to accomplish undefiled discipline

source: །དེས་ནི་ཟག་མེད་ཚུལ་ཁྲིམས་བསྒྲུབ་པར་ནུས། །ཟག་མེད་ཚུལ་ཁྲིམས་མངོན་པར་བསྒྲུབ་པས་ན།
en: Is able to accomplish undefiled discipline

source: །དེས་ནི་ཟག་མེད་ཤེས་རབ་བསྒྲུབ་མི་ནུས། །ཟག་མེད་ཤེས་རབ་མངོན་པར་མི་སྒྲུབ་པས།
en: Is unable to accomplish undefiled insight

source: །དེས་ནི་ཟག་མེད་ཤེས་རབ་བསྒྲུབ་པར་ནུས། །ཟག་མེད་ཤེས་རབ་མངོན་པར་བསྒྲུབ་པས་ན།
en: Is able to accomplish undefiled insight

source: །མིག་སྟོང་ཉིད་ལ་རྟག་ཏུ་རྨོངས་པར་འགྱུར།
en: Will always be deluded about the eye’s emptiness;

source: །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་མི་སྐྱེད་པས།
en: That person will not give rise to the all-retaining wisdom

source: །མདོ་སྡེ་འདི་ལ་རབ་ཏུ་མོས་མི་འགྱུར།
en: And will therefore not be interested in this discourse.

source: །མིག་སྟོང་ཉིད་ནི་རྟག་པར་རྟོགས་པར་འགྱུར།
en: Will always realize the emptiness of the eye;

source: །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་རབ་བསྐྱེད་པས།
en: That person will give rise to the all-retaining wisdom

source: །མདོ་སྡེ་འདི་ལ་རབ་ཏུ་མོས་པར་འགྱུར།
en: And will therefore be interested in this discourse.

source: །གང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་རྟོགས་པ།
en: “When someone who realizes the essential nature of the eye’s exhaustion

source: །དེས་ནི་ཀུན་འཛིན་ཡེ་ཤེས་བསྒྲུབ་པ་ན།
en: Accomplishes the all-retaining wisdom,

source: །བླ་མེད་མ་ཆགས་ཡེ་ཤེས་རབ་བསྒྲུབས་པས།
en: They accomplish the unsurpassed wisdom free of attachment

source: །གང་ཞིག་མདོ་སྡེ་འདི་ལ་མ་མོས་པ།
en: “Someone who is not interested in this discourse

source: །མིག་ཟད་ངོ་བོ་ཉིད་ལ་རྟག་ཏུ་རྨོངས།
en: And always deluded about the essential nature of the eye’s exhaustion

source: །དེས་ནི་ཏིང་འཛིན་རྣམས་ལས་ཉམས་པས་ན།
en: Will regress from the state of absorption

source: །བླ་མེད་ཡེ་ཤེས་ཐོབ་པར་ཤིན་ཏུ་དཀའ།
en: And thus find it hard to attain unsurpassed wisdom.

source: །གང་ཞིག་མདོ་སྡེ་འདི་ལ་རབ་མོས་ཤིང་།
en: “Someone who is strongly interested in this discourse

source: །མིག་ཟད་ངོ་བོ་ཉིད་ནི་མངོན་རྟོགས་པ།
en: And realizes the essential nature of the eye’s exhaustion

source: །དེས་ནི་ཏིང་འཛིན་མངོན་པར་བསྒྲུབས་པས་ན།
en: Will accomplish the state of absorption

source: །བླ་མེད་ཡེ་ཤེས་མངོན་བྱེད་དཀའ་བ་མེད།
en: And thus not find it hard to actualize unsurpassed wisdom.

source: །གང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་རྟོགས་ཤིང་།
en: “Someone who realizes the essential nature of the eye’s exhaustion

source: །བདག་མེད་པ་ཡི་མཚན་ཉིད་རབ་ཤེས་པ།
en: And clearly understands the characteristic of selflessness

source: །དེས་ནི་རྟག་ཏུ་ཆོས་འདི་ཐོས་པས་ན། །མངོན་པར་ཡིད་ཆེས་ཐེ་ཙོམ་མེད་པ་འཐོབ།
en: Will always gain trust and freedom from doubts Upon hearing this Dharma teaching.

source: །གང་ཞིག་མིག་ཟད་ངོ་བོ་ཉིད་སེམས་ཤིང་།
en: “Someone free from laziness who diligently contemplates,

source: །ཉིན་མཚན་རབ་བརྩོན་ལེ་ལོ་མེད་གྱུར་པ།
en: Day and night, the essential nature of the eye’s exhaustion

source: །དེས་ནི་ཀུན་འཛིན་སྤོབས་པ་མངོན་བསྒྲུབས་ནས།
en: Will accomplish retention and eloquence

source: །མདོ་སྡེ་འདི་ནི་རྟག་ཏུ་སྟོན་པར་འགྱུར།
en: And continuously teach this discourse.

source: །གང་ཞིག་མདོ་སྡེ་འདི་ནི་སེམས་བྱེད་པ།
en: “Someone who contemplates this discourse

source: །འོད་ཟེར་འབྱིན་པའི་ཡེ་ཤེས་རྫོགས་པར་འགྱུར།
en: Will perfect the wisdom of emitting light;

source: །དེས་ནི་དེ་བཞིན་གཤེགས་པ་རབ་སྟོན་ཅིང་།
en: That person will clearly reveal the thus-gone ones

source: །མིག་སྟོང་ཉིད་ནི་རབ་ཏུ་རྟོགས་པར་འགྱུར།
en: And realize the emptiness of the eye. “The qualities derived from contemplating this discourse

source: །གང་ཞིག་མཆོད་རྟེན་བརྒྱ་སྟོང་རབ་བྱས་ཤིང་།
en: Are more exalted than those

source: །སངས་རྒྱས་ཐམས་ཅད་མཆོད་པ་བྱས་པ་བས།
en: Derived from worshiping all the buddhas By building a hundred thousand stūpas.

source: །གང་ཞིག་མདོ་སྡེ་འདི་ནི་སེམས་བྱེད་ན།
en: “The qualities derived from hearing this discourse

source: །འདི་ཡི་ཡོན་ཏན་དེ་བས་ཁྱད་པར་འཕགས།
en: Are more exalted than those Derived from worshiping the thus-gone ones’ relics

source: །གང་གིས་རོལ་མོ་བརྒྱ་སྟོང་རབ་བྱས་ནས། །དེ་བཞིན་གཤེགས་པའི་རིང་བསྲེལ་མཆོད་པ་བྱས།
en: By playing a hundred thousand musical instruments.

source: །གང་ཞིག་མདོ་སྡེ་འདི་ནི་ཐོས་གྱུར་ན།
en: “The merit created by honoring this discourse

source: །སངས་རྒྱས་སྤྱན་གྱིས་གཟིགས་པའི་སེམས་ཅན་རྣམས།
en: Created by honoring all the sentient beings beheld by the Buddha’s eyes

source: །བསྐལ་པ་དག་ནི་བྱེ་བ་ཚད་མེད་པར། །དེ་བཞིན་གཤེགས་དང་མཚུངས་པར་མཆོད་པ་བས། །མདོ་སྡེ་འདི་བཟུང་བསོད་ནམས་ཁྱད་པར་འཕགས།
en: For countless millions of eons, as if they were thus-gone ones.

source: །གང་ཞིག་མདོ་སྡེ་འདི་ལ་ཚིག་བཞི་པའི། །ཚིགས་བཅད་གཅིག་ཙམ་འཛིན་ཅིང་སྟོན་བྱེད་ན།
en: “Someone who memorizes a single four-line verse

source: །དེ་ལ་རྒྱལ་བ་ཐུགས་རྗེ་ཆེན་པོ་ཡི།
en: From this discourse and teaches it to others

source: །གཙོ་ལྟར་གུས་པ་རབ་ཏུ་བསྐྱེད་པར་བྱ།
en: Should be revered As the most compassionate Victor.

source: །ང་ནི་འདས་པའི་བསྐལ་པ་བརྒྱ་སྟོང་དུ།
en: “For a hundred thousand eons in the past,

source: །སྲིད་པ་གསུམ་དུ་འཁོར་བར་གྱུར་པའི་ཚེ།
en: When I was circling in the three realms,

source: །སངས་རྒྱས་དག་ནི་ཚད་མེད་པ་རྣམས་ལ།
en: I served countless buddhas

source: །མདོ་སྡེ་འདི་ཡི་ཕྱིར་ནི་རིམ་གྲོ་བྱས།
en: For the sake of this discourse. “To master this discourse,

source: །རེས་འགའ་མར་མེ་བརྒྱ་སྟོང་ཚད་མེད་པ།
en: At times I lit countless hundreds of thousands of lamps—

source: །སྙིང་པོ་རེ་རེའི་ཚད་ཀྱང་དཔག་ཚད་ཙམ།
en: Each of their wicks measuring about a league—

source: །སྦར་ནས་མདོ་སྡེ་འདི་ལ་རང་དབང་དག །འཐོབ་པར་བྱ་ཕྱིར་འདྲེན་པ་རྣམས་ལ་མཆོད།
en: And offered those to the great guides.

source: །རེས་འགའ་མེ་ཏོག་ཙམ་པ་ཀ་དང་ནི། །སུ་མ་ན་དང་མྱ་ངན་མེད་པ་ཡི།
en: “I sometimes worshiped the stūpas of thus-gone ones

source: །ཕྲེང་བ་རྒྱལ་མཚན་གདུགས་ནི་སྣ་ཚོགས་ཀྱིས།
en: With different types of offerings Such as garlands of magnolias, jasmine, and aśoka flowers,

source: །དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་མཆོད་པ་བྱས།
en: And banners and parasols.

source: །ང་སྔོན་འཁོར་བའི་འཁོར་བར་གྱུར་པའི་ཚེ།
en: “In the past, when I was circling in saṃsāra,

source: །སློང་དུ་འོངས་པ་དག་ལ་སྦྱིན་བཏང་སྟེ།
en: I practiced charity toward those who asked for favors;

source: །རེས་འགའ་མེ་ཏོག་འབྲས་བུ་དག་ཀྱང་བཏང་།
en: I sometimes gave them flowers and fruits,

source: །རེས་འགའ་ཟམ་པ་ཁྲོན་པ་ཆུ་མིག་བཏང་།
en: Sometimes bridges, wells, and springs,

source: །རེས་འགའ་གླང་པོ་ཆེ་དང་བཞོན་པ་བཏང་།
en: “Sometimes elephants and vehicles,

source: །རེས་འགའ་རིན་ཆེན་རྟ་དང་ཆུང་མ་བཏང་།
en: Sometimes precious steeds and maidens,

source: །རེས་འགའ་གསེར་གྱི་ཁྲི་དང་རིན་ཆེན་གུར།
en: Sometimes golden thrones and bejeweled tents,

source: །རེས་འགའ་སེ་མོ་དོ་དང་ཕྲེང་བ་བཏང་།
en: And sometimes necklaces and garlands.

source: །དེ་བཞིན་བསྐལ་པ་བརྒྱ་སྟོང་རྫོགས་པར་ནི།
en: “In that way, for all those Hundreds of thousands of eons,

source: །མདོ་སྡེ་འདི་ཕྱིར་སེམས་ལ་སེར་སྣ་མེད།།
en: My mind was always free of miserliness

source: །།བམ་པོ་གཉིས་པ།
en: For the sake of this discourse.

source: ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར།
en: “In the past, for the sake of this discourse,

source: །ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་བསྲུངས།
en: I observed completely pure discipline;

source: །ཏིང་འཛིན་ཤེས་རབ་རྟག་ཏུ་བསྒོམས།
en: I constantly cultivated absorption and insight

source: །སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་བཏང་།
en: And practiced generosity toward sentient beings.

source: །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར།
en: “In the past, for the sake of this discourse, I never harmed anyone—

source: །གཏུམ་པོ་དག་གིས་བརྒྱད་བཀག་ཀྱང་།
en: Even the vicious ones who threatened me—

source: །དེ་ཚེ་ང་ནི་སྙིང་བརྩེ་བས། །དེ་ལ་གནོད་པ་ཡོད་མ་བྱས།
en: Out of my love for them.

source: །སློང་དུ་འོངས་པ་དག་ལ་ནི། །ཇི་ལྟར་མོས་བཞིན་རབ་བཏང་བས།
en: To all those who came to ask for favors,

source: །ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱས།
en: By fulfilling all their wishes.

source: །གཞལ་མེད་ཁང་ཆེན་རྣམས་ལ་ནི།
en: I ornamented mansions

source: །རིན་ཆེན་དྲ་བས་རབ་བརྒྱན་ནས།
en: With garlands of jewels

source: །སངས་རྒྱས་རྣམས་ལ་ཡོངས་སུ་ཕུལ།
en: And offered those to the buddhas.

source: །རིན་ཆེན་རྣམ་པ་སྣ་ཚོགས་དང་། །ཡིད་བཞིན་ནོར་བུ་རིན་པོ་ཆེས།
en: By offering them a variety of jewels

source: །སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་བྱས།
en: And wish-fulfilling gems.

source: །དྲིན་ཡོད་རྣམས་ལ་རྟག་དྲན་པས།
en: I always remembered the gracious ones

source: །ཐ་ན་ཚིགས་བཅད་གཅིག་མཉན་པ།
en: And venerated every single verse

source: །དེ་ལ་ཡང་ནི་བཀུར་སྟི་བྱས།
en: That I heard from them.

source: །ཚུལ་ཁྲིམས་ལྡན་ལ་རབ་བཀུར་བས། །ཐ་ན་འཆག་པའི་ཚེ་ན་ཡང་།
en: I revered those who were disciplined

source: །དེ་ལ་རྟག་ཏུ་གུས་པ་བསྐྱེད།
en: And always showed respect for them, Even when I was walking.

source: །ང་སྔོན་མདོ་སྡེ་འདི་ཡི་ཕྱིར། །འཁོར་བ་དག་ན་འཁོར་བའི་ཚེ། །དྲིན་ནི་ཅུང་ཟད་ཡོད་པ་ལའང་།
en: “When I was circling in saṃsāra in the past,

source: །དེ་ལ་རྟག་ཏུ་དྲིན་དུ་གཟོས།
en: For the sake of this discourse I always expressed my gratitude To those who extended even the slightest favor.

source: །རྙེད་པ་མ་བཙལ་ཆོས་མ་སྐུར། །ཉེ་བཤེས་སེམས་ཅན་རྣམས་ལ་ནི།
en: I did not seek personal gain and I did not deprecate the Dharma.

source: །སྙིང་བརྩེ་དག་ནི་རབ་ཏུ་བསྐྱེད།
en: Instead, I developed sympathy For my relatives and friends, and for all beings.

source: །མང་ཐོས་ལེགས་བཤད་ལྡན་པས་ན།
en: I became learned and eloquent.

source: །ཆོས་ལ་མངོན་པར་ཞེན་བྱེད་ཅིང་།
en: I did not cling to phenomena

source: །བཤེས་པའི་ཁྱིམ་ལ་སེར་སྣ་མེད།
en: And had no miserliness regarding the household of friends.

source: །མི་དགེའི་སེམས་ནི་སྐྱེས་གྱུར་ན། །མྱུར་བ་ཉིད་དུ་རབ་བཤགས་པས།
en: Whenever a nonvirtuous thought arose in me,

source: །འཕེལ་བར་ཡང་ནི་ཡོད་མ་བྱས།
en: I would never let it develop But immediately confessed it.

source: །རྒྱལ་པོའི་བུར་ནི་གྱུར་བ་ན། །རིན་པོ་ཆེ་དང་བྱུག་སྤོས་དང་། །སྤོས་ཀྱི་ཕྱེ་མ་ཇི་སྙེད་པ།
en: When I was born as a prince,

source: །དད་པའི་སེམས་ནི་ངས་བསྐྱེད་ནས། །སངས་རྒྱས་རྣམས་ལ་བསྔོས་ཤིང་ཕུལ།
en: I faithfully dedicated and offered to the buddhas All my gems, perfumed ointments, and fragrant powders.

source: །ཁྲི་མོན་བཙོན་ལ་སྙིང་བརྩེ་བས།
en: Out of sympathy for prisoners, I took upon myself, as a physical bail,

source: །སྡུག་བསྔལ་སྣ་ཚོགས་གང་མྱོང་བ། །ལུས་ཀྱི་སྐྱིན་པར་དང་དུ་བླངས།
en: The many sufferings they experienced.

source: །འདོད་པའི་ཡོན་ཏན་ལྔ་སྤངས་ནས།
en: I renounced the five sense pleasures

source: །རྟག་ཏུ་དུས་དྲུག་དག་གི་ཚེ། །སྡོམ་པ་དག་ནི་རབ་ཏུ་བླངས།
en: And always took the precepts At the six times of the month.

source: །རྟག་ཏུ་བཟོད་པ་རབ་བསྒོམས་པས།
en: I always cultivated patience And never gave rise to desirous miserliness,

source: །ཐ་ན་ཆུང་མ་དག་ལ་ཡང་། །འདོད་པའི་སེར་སྣ་ཡོང་མ་བསྐྱེད།
en: Even with respect to my wives.

source: །དབུལ་ཕོངས་དག་ནི་ཐམས་ཅད་ཀུན། །བདེ་བ་དག་ནི་ཐོབ་བྱའི་ཕྱིར།
en: I enriched all destitute beings

source: །ནོར་དག་གིས་ནི་ཕྱུག་པོར་བྱས།
en: By offering them wealth, So that they could experience happiness.

source: །དགེ་སྦྱོང་དང་ནི་བྲམ་ཟེ་དང་། །སྐྱེ་དགུ་རྣམ་པ་སྣ་ཚོགས་ཀུན། །ཐམས་ཅད་དག་ནི་རབ་ཏུ་བསྡུས།
en: Mendicants, brahmins, And all the various other types of beings.

source: །ཐམས་ཅད་ཀུན་ལ་ཕན་གདགས་ཕྱིར།
en: I gave generously to those in need,

source: །རྟག་ཏུ་སྦྱིན་བདག་ཆེར་བྱས་ནས།
en: Always acting as a great benefactor

source: །སློང་བ་དག་ལ་ཡོངས་སུ་བཏང་།
en: To benefit all beings.

source: །རེས་འགའ་མེ་ཏོག་འབྲས་བུ་དག །གཞན་དག་གཅོད་དུ་མི་གཞུག་པར།
en: “I sometimes fulfilled

source: །སེམས་ཅན་རྣམས་ལ་ཡོངས་བཏང་ཞིང་།
en: The wishes of sentient beings By giving them flowers and fruits,

source: །ཡིད་བཞིན་དུ་ནི་ཚིམ་པར་བྱས།
en: Without sending anyone away.

source: །ང་སྔོན་སྦྱིན་པ་གཏོང་བའི་ཚེ།
en: “When I was practicing generosity in the past,

source: །སེམས་ནི་རྟག་ཏུ་སྙོམས་པས་ན།
en: I constantly maintained an impartial attitude. Therefore, with a sense of modesty, I respectfully practiced generosity toward everyone— “Those endowed with the qualities of discipline,

source: །ཚུལ་ཁྲིམས་ཡོན་ཏན་ལྡན་པ་དང་། །ཚུལ་ཁྲིམས་འཆལ་དང་ངོ་ཚ་མེད།
en: Those who observed improper discipline, those who had no sense of shame,

source: །རྫུ་འཕྲུལ་ཆེན་པོ་ཐོབ་པ་ནས།
en: And those who had achieved great miraculous power,

source: །སོ་སོའི་སྐྱེ་བོའི་བར་དག་ལ།
en: As well as all other ordinary beings.
